In [38]:
import pandas as pd

Let's import the csv file

source: https://www.kaggle.com/datasets/yasserh/titanic-dataset?resource=download

In [39]:
df = pd.read_csv('/Users/Asus/Classe16/Boolean/Porfolios/titanic_passengers_analysis/Data/Titanic-Dataset.csv')

Here is the dataframe with data present in the dataset

In [40]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Pandas automatically adds a default index column (the first one). Since the titanic_dataset.csv already contains PassengerId which serves as a suitable index, we can export the database as follows:

In [41]:
df = pd.read_csv('/Users/Asus/Classe16/Boolean/Porfolios/titanic_passengers_analysis/Data/Titanic-Dataset.csv', 
                 index_col="PassengerId")

In [42]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [43]:
df.index

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       882, 883, 884, 885, 886, 887, 888, 889, 890, 891],
      dtype='int64', name='PassengerId', length=891)

In [44]:
df.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [45]:
df.shape

(891, 11)

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

Running df.info() shows the 'Name', 'Sex', 'Ticket', 'Cabin', and 'Embarked' columns are currently the generic object type. To improve performance, ensure type safety, and achieve consistent missing value handling, we should assign these text columns the dedicated string dtype during the read phase using the dtype parameter:

In [56]:
df = pd.read_csv('/Users/Asus/Classe16/Boolean/Porfolios/titanic_passengers_analysis/Data/Titanic-Dataset.csv', 
                 index_col="PassengerId",
                 dtype={'Name': pd.StringDtype(), 'Sex': pd.StringDtype(), 'Ticket': pd.StringDtype(),
                        'Cabin': pd.StringDtype(), 'Embarked': pd.StringDtype()})

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    string
 3   Sex       891 non-null    string
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    string
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    string
 10  Embarked  889 non-null    string
dtypes: float64(2), int64(4), string(5)
memory usage: 83.5 KB

Let's now examine some descriptive statistics to gain insight into the passengers' details, such as the age of the oldest passenger or the most expensive ticket price.

In [52]:
df.max()

/var/folders/xv/pwx4n4zd0nn545t0k6s1p__c0000gn/T/ipykernel_9886/1151452817.py:1: FutureWarning: <class 'pandas.core.arrays.string_.StringArray'>._reduce will require a `keepdims` parameter in the future
  df.max()

Survived                              1
Pclass                                3
Name        van Melkebeke, Mr. Philemon
Sex                                male
Age                                80.0
SibSp                                 8
Parch                                 6
Ticket                        WE/P 5735
Fare                           512.3292
Cabin                                 T
Embarked                              S
dtype: object

The Fare is in GBP. The most expensice ticke is £512 that seems low for a suit on the transatlantic, but £500 in the early 1900s was worth almost £80K today.

We will analyze whether this passenger, who paid a premium fare, ultimately survived when we examine the survival data later in our analysis.

In [54]:
df.min()

/var/folders/xv/pwx4n4zd0nn545t0k6s1p__c0000gn/T/ipykernel_9886/3962516015.py:1: FutureWarning: <class 'pandas.core.arrays.string_.StringArray'>._reduce will require a `keepdims` parameter in the future
  df.min()

Survived                      0
Pclass                        1
Name        Abbing, Mr. Anthony
Sex                      female
Age                        0.42
SibSp                         0
Parch                         0
Ticket                   110152
Fare                        0.0
Cabin                       A10
Embarked                      C
dtype: object

Let's check now the total Ticket Fare:

In [64]:
df.sum(numeric_only=True).round(0)

Survived      342.0
Pclass       2057.0
Age         21205.0
SibSp         466.0
Parch         340.0
Fare        28694.0
dtype: float64

The total revenue was almost £30k, equivalent to £3.5M today.

Let's check now the average values:

In [66]:
df.mean(numeric_only=True).round(2)

Survived     0.38
Pclass       2.31
Age         29.70
SibSp        0.52
Parch        0.38
Fare        32.20
dtype: float64

The majority of passengers traveled in second or third class, and these groups experienced significantly lower survival rates.